Revit 2026 API

# BuiltInFailuresViewPositionFailures Class

---

Failures about Viewport Positions.

SystemObject Autodesk.Revit.DBBuiltInFailuresViewPositionFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ViewPositionFailures
```
```vb
Public NotInheritable Class ViewPositionFailures
```
```cpp
public ref class ViewPositionFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ViewPositionFailures = class end
```

The BuiltInFailuresViewPositionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CantMoveViewport | Can't move Viewport when its placement is controlled by the assigned View Position. |
|  | CropRequiredAlignment | Can't move Viewport when its placement is controlled by the assigned View Position. |
|  | ViewAnchorDoesNotSupportView | The View Anchor ""%1!s!"" is not supported by view ""%2!s!"". |

#### Reference

Autodesk.Revit.DB Namespace